class Poetry {
  int id;
  String name;
  String content;

  Poetry({
    required this.id,
    required this.name,
    required this.content,
  });
}

List<Poetry> sampleNotes = [
  Poetry(
      id: 0,
      name: 'إمرؤ القيس',
      content:
          'قِفَا نَبْكِ مِن ذِكْرَى حَبِيبٍ وَمَنزِلِ\n            بِسِقْطِ اللِّوَى بَيْنَ الدَّخُولِ فَحَومَلِ'),
  Poetry(
      id: 1,
      name: 'المتنبي',
      content:
          'فَلا تَقنَعْ بما دونَ النّجومِ\n            إذا غامَرتَ في شَرَفٍ مَرُومِ'),
  Poetry(
      id: 2,
      name: 'أبو الطيب المتنبي',
      content:
          'إِنَّ العِبَادَ بِأَسْيَافٍ وَسُيُوفُهُمُ\n            لا تَشْتَرِ العَبْدَ إِلّا وَالعِصَا مَعَهُِ'),
  Poetry(
      id: 3,
      name: 'أبو العلاء المعري',
      content:
          'فَإِنْ هُمُ ذَهَبُوا ذَهَبَتْ أَخْلاَقُهُمْ\n            وَإِنَّمَا الأُمَمُ الأَخْلاَقُ مَا بَقِيَتْ'),
  Poetry(
      id: 4,
      name: 'جرير',
      content:
          'وَسافِرْ فَفِي الأَسفَارِ خَمسُ فَوَائِدِ\n            تَغَرَّبْ عَنِ الأَوطَانِ في طَلَبِ العُلَى'),
  Poetry(
      id: 5,
      name: 'الفرزدق',
      content:
          'هُزّي إِلى الفُراتِ فَإِنَّ حَياً\n            هُزّي إِلى الفُراتِ فَإِنَّ حَياً'),
  Poetry(
      id: 6,
      name: 'بشار بن برد',
      content:
          'وَهُوَ فِي الباطِنِ لَوْ تَعْلَمُ غَثُّ\n            وَمِنَ النّاسِ مَنْ يُعجِبُكَ شَكْلُهُ'),
  Poetry(
      id: 7,
      name: 'الشريف الرضي',
      content:
          'وَأَمَرُّ مِن وَبَالِ الجَلِيدِ\n            وَمِنَ الكَلامِ ما هُوَ أَشَدُّ مِنَ الحَدِيدِ'),
  Poetry(
      id: 8,
      name: 'ابن الرومي',
      content:
          'وَلَحمُ الضَّأنِ تَأكُلُهُ الكِلابُ\n            تَمُوتُ الأَسَدُ في الغَاباتِ جُوعاً'),
  Poetry(
      id: 9,
      name: 'المعري',
      content: 'فلا يغر بطيب العيش إنسان\n            لكل شيء إذا ما تم نقصان'),
];
